#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

////【题目名称】
////最大公约数
////【题目内容】
////给定两个数，求这两个数的最大公约数
////例如：
////输入：20 40
////输出：20
//
//int main()
//{
//	int a = 20;
//	int b = 40;
//	int i = 1;
//	int min = 1;
//	int max = 0;
//	scanf("%d %d", &a, &b);
//	if (a >= b)
//		min = b;
//	else
//		min = a;
//	for (i = 1; i <= min; i++)
//	{
//		if ((a % i == 0) && (b % i == 0))
//			max = i;
//	}
//	printf("%d", max);
//	return 0;
//}


////【题目名称】
////最大公约数
////【题目内容】
////给定两个数，求这两个数的最大公约数			代码优化1.0		从较大值逐渐减小

//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d%d", &a, &b);
//	int min = a > b ?  b : a;
//	int i = 0;
//
//	for (i = min; ; i--)
//	{
//		if (a % i == 0 && b % i == 0)
//		{
//			printf("最大公约数:%d", i);
//			break;
//		}
//	}
//
//	return 0;
//}


//////【题目名称】
//////最大公约数
//////【题目内容】
//////给定两个数，求这两个数的最大公约数			代码优化2.0		辗转相除法

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int t = 0;
//	//输入
//	scanf("%d%d", &a, &b);		//取地址符  &   不能忘记
//	int a1 = a;
//	int b1 = b;
//	//运算
//	while (t = a % b)
//	{
//		a = b;
//		b = t;
//	}
//	//输出
//	printf("最大公约数:%d\n", b);
//	//最小公倍数
//	// a*b / 最大公约数
//	printf("最大公倍数:%d", a1 * b1 / b);
//	return 0;
//}


////【题目名称】
////打印闰年
////【题目内容】
////打印1000年到2000年之间的闰年
//
//void main()
//{
//	int count = 0;
//	int i = 1000;
//	for (i = 1000; i <= 2000; i++)
//	{
//		if ((i % 4 == 0) && (i % 100 != 0) || (i % 400 == 0))
//		{
//			printf("%6d", i);
//			count++;
//		}
//	}
//	printf("\ncount = %d\n", count);
//	//return 0;
//}


////【题目名称】
////打印素数
////【题目内容】
////写一个代码：打印100~200之间的素数

//int main()
//{
//	int i = 100;
//	for (i = 100; i <= 200; i++)
//	{
//		//int n = 2;
//		for (int j = 2; j < i; j++)
//		{
//			if (i % j == 0)
//				break;
//			else 
//			{
//				if(j == i-1)
//					printf("%-5d", i);
//				//n++;
//			}
//		}
//	}
//	return 0;
//}


//////【题目名称】
//////打印素数(质数)
//////【题目内容】
//////写一个代码：打印100~200之间的素数			（算法）代码优化1.0
////思路:一个数可以等于两个数乘积的形式,其中每个乘数都是它的因素
////例如:16 = 2*8 = 1* 16 = 4*4 ,排除1和它自身,如果还有这样的整数表达式存在,那它就不是素数
////	    n = a*b ,其中 a和b其中必有一个 <= 根号下n ,a 和 b 负相关,此消彼长,临界时: a = b = 根号下n
////		n = 根号下n *根号下n;
////		由此可以减少循环次数,从 2 ~ i-1 减少为 2 ~ 根号下i
////此外,此范围内偶数一定不是素数,所以只计算奇数
//
//#include <math.h>		//sqrt求平方根
//int main()
//{
//	int i = 100;
//	int num = 0;
//	for (i = 101; i <= 200; i += 2)
//	{
//		int j = 0;
//		int flag = 1;
//		for (j = 2; j <= sqrt(i); j++)
//		{
//			if (i % j == 0)
//			{
//				flag = 0;
//				break;
//			}
//		}
//		if (flag == 1)
//		{
//			printf("%-5d", i);
//			num++;
//		}
//	}
//	printf("\nnum = %d", num);
//	return 0;
//}


////【题目名称】
////从大到小输出
////【题目内容】
////写代码将三个整数数按从大到小输出。
////例如：
////输入：2 3 1
////输出：3 2 1
//
//int main()
//{
//	//改变 数组元素个数 和 循环次数   可排序个数增加  
//	int arr[3] = { 2, 3 ,1 };			
//
//	//输入
//	for (int i = 0; i < 3; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//
//	//排序,首位数 i 从前往后一次比较大小,交换次序,像波浪传递,将最小传递到最后
//	for (int i = 0; i < 3; i++)
//	{
//		for (int i = 0; i < 3; i++)
//		{
//			if (i + 1 == 3)
//				break;
//			if (arr[i] < arr[i + 1])
//			{
//				int a = arr[i];
//				arr[i] = arr[i + 1];
//				arr[i + 1] = a;
//			}
//		}
//	}
//	
//
//	//输出
//	for (int i = 0; i < 3; i++)
//	{
//		printf("%-5d", arr[i]);
//	}
//
//	return 0;
//}


////【题目名称】
////打印3的倍数的数
////【题目内容】
////写一个代码打印1 - 100之间所有3的倍数的数字
//
//int main()
//{
//	int i = 1;
//	for (i = 1; i <= 100; i++)
//	{
//		if (i % 3 == 0)
//			printf("%-5d", i);
//	}
//	return 0;
//}



